In [1]:
from warnings import filterwarnings 
filterwarnings("ignore")

import pandas as pd
import numpy as np

In [2]:
realtor_data_df = pd.read_csv('outliers.csv')
realtor_data_df["prev_sold_year"] = pd.to_datetime(realtor_data_df["prev_sold_date"], format='%Y-%m-%d').dt.year

In [3]:
for_sale_df = realtor_data_df

In [4]:
for_sale_df[for_sale_df["zip_code"].isna()]

Empty DataFrame
Columns: [Unnamed: 0, bed, bath, acre_lot, zip_code, house_size, prev_sold_date, price, prev_sold_year]
Index: []

In [5]:
for_sale_df.dropna(subset=['zip_code'], inplace=True)
for_sale_df["zip_code_str"] = for_sale_df["zip_code"].apply(int).apply(str)
for_sale_df.head()

,Unnamed: 0,bed,bath,acre_lot,zip_code,house_size,prev_sold_date,price,prev_sold_year,zip_code_str
0,1,3.0,2.0,2.02,12521.0,1600.0,2021-11-24,425000.0,2021,12521
1,2,4.0,2.0,0.24,12521.0,1239.0,2018-02-01,225000.0,2018,12521
2,7,3.0,2.0,1.20,12546.0,1350.0,2018-08-31,375000.0,2018,12546
3,16,3.0,2.0,5.01,12060.0,2504.0,2020-11-09,435000.0,2020,12060
4,27,3.0,2.0,19.70,12529.0,1200.0,2021-01-20,625000.0,2021,12529

In [6]:
zipcodes = for_sale_df["zip_code"]
len(zipcodes.unique())

1145

In [7]:
# Because of its size this dataset is not saved in the code repo for this project.
# It can be downloaded and saved in the same path to make this Notebook run.
zip_lon_lat = pd.read_csv('../../../zip_lat_long.csv')
zip_lon_lat.rename(columns={"ZIP":"zip_code", "LAT":"latitude", "LNG":"longitude"},inplace=True)
zip_lon_lat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33144 entries, 0 to 33143
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   zip_code   33144 non-null  int64
 1   latitude   33144 non-null  float64
 2   longitude  33144 non-null  float64
dtypes: float64(2), int64(1)
memory usage: 776.9 KB

In [8]:
find_zipcodes_df = zip_lon_lat[zip_lon_lat["zip_code"].isin(zipcodes.unique())]
find_zipcodes_df["zip_code_str"] = find_zipcodes_df["zip_code"].apply(str)
find_zipcodes_df.head()

      zip_code   latitude  longitude zip_code_str
2569     10001  40.750633 -73.997177        10001
2570     10002  40.715775 -73.986212        10002
2571     10003  40.731829 -73.989181        10003
2572     10004  40.688630 -74.018244        10004
2573     10005  40.706027 -74.008835        10005

In [9]:
merge_df = for_sale_df.merge(find_zipcodes_df, how='outer', on='zip_code_str')


merge_df.rename(columns={"zip_code_x":"zip_code"},inplace=True)
merge_df.drop(columns=["zip_code_y"],inplace=True)

merged_df.to_csv('zip-lon-lat.csv')

uniquezip.sort_values(0).to_csv("zipcodes.csv")

In [10]:
merge_df[merge_df["latitude"].isna()]

,Unnamed: 0,bed,bath,acre_lot,zip_code,house_size,prev_sold_date,price,prev_sold_year,zip_code_str,latitude,longitude
2252,2805,3.0,2.0,0.05,10129.0,1200.0,2019-08-02,2650000.0,2019,10129,NaN,NaN
3903,3510,1.0,1.0,0.05,11249.0,1200.0,2018-07-20,895000.0,2018,11249,NaN,NaN
3904,4895,4.0,2.0,0.05,11249.0,1200.0,2019-11-06,2900000.0,2019,11249,NaN,NaN
3905,10988,1.0,2.0,0.05,11249.0,905.0,2017-01-05,1225000.0,2017,11249,NaN,NaN
3906,12594,2.0,1.0,0.05,11249.0,1200.0,2018-12-12,1400000.0,2018,11249,NaN,NaN
3907,12597,1.0,1.0,0.05,11249.0,816.0,2017-01-03,1050000.0,2017,11249,NaN,NaN
3908,16892,1.0,2.0,0.05,11249.0,848.0,2016-12-29,950000.0,2016,11249,NaN,NaN
3909,16896,2.0,2.0,0.05,11249.0,1336.0,2017-06-06,1450000.0,2017,11249,NaN,NaN
3910,17145,2.0,2.0,0.05,11249.0,1129.0,2019-05-30,1500000.0,2019,11249,NaN,NaN
3911,23679,1.0,1.0,0.05,11249.0,688.0,2017-12-22,1240000.0,2017,11249,NaN,NaN
3912,25543,1.0,1.0,0.05,11249.0,787.0,2017-12-18,1100000.0,2017,11249,NaN,NaN
4334,5126,1.0,2.0,0.05,11243.0,1152.0,2017-06-22,1450000.0,2017,11243,NaN,NaN
4335,16900,3.0,1.0,0.05,11243.0,489.0,2016-11-23,499000.0,2016,11243,NaN,NaN
6075,14613,3.0,2.0,0.61,10982.0,1916.0,2021-12-31,800000.0,2021,10982,NaN,NaN

In [11]:
merge_df.dropna(subset=['latitude'], inplace=True)

In [12]:
merge_df.head()

,Unnamed: 0,bed,bath,acre_lot,zip_code,house_size,prev_sold_date,price,prev_sold_year,zip_code_str,latitude,longitude
0,1,3.0,2.0,2.02,12521.0,1600.0,2021-11-24,425000.0,2021,12521,42.171335,-73.650487
1,2,4.0,2.0,0.24,12521.0,1239.0,2018-02-01,225000.0,2018,12521,42.171335,-73.650487
2,387,3.0,3.0,0.09,12521.0,1320.0,2020-02-28,995000.0,2020,12521,42.171335,-73.650487
3,696,3.0,3.0,5.00,12521.0,2517.0,2017-05-30,895000.0,2017,12521,42.171335,-73.650487
4,7,3.0,2.0,1.20,12546.0,1350.0,2018-08-31,375000.0,2018,12546,41.948000,-73.523349

In [13]:
merge_df.to_csv("geocoded.csv")